# IsSchedulableField Method

---
C#Visual BasicVisual C++
Revit 2024 API
---
ScheduleDefinition..::..IsSchedulableField Method
ScheduleDefinition Class See Also
---
Checks whether a non-calculated/non-combined field is eligible to be included in this schedule.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2013
# Syntax
C#
---
```text
public bool IsSchedulableField(
	SchedulableField schedulableField
)
```

Visual Basic
---
```text
Public Function IsSchedulableField ( _
	schedulableField As SchedulableField _
) As Boolean
```

Visual C++
---
```text
public:
bool IsSchedulableField(
	SchedulableField^ schedulableField
)
```

# ### Parameters
schedulableField
    Type: Autodesk.Revit.DB..::..SchedulableField The field to check.
# ### Return Value
True if the field may be included in the schedule, false otherwise.
# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentNullException | A non-optional argument was null |

# See Also
ScheduleDefinition Class
Autodesk.Revit.DB Namespace